Revit 2027 API
RebarCrankOverridableParameters.GetCrankStartAngledLengthFormulaParams Method
 Gets the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCrankStartAngledLengthFormulaParams()
Public Function GetCrankStartAngledLengthFormulaParams As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCrankStartAngledLengthFormulaParams()
member GetCrankStartAngledLengthFormulaParams : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters.
See Also
Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace